content/posts/huang2017.md
+++
title = "huang2017 | Dual-quaternion based distributed coordination control of six-DOF spacecraft formation with collision avoidance"
author = ["João Gutemberg Farias"]
draft = false
+++

The work proposes a [formation control]({{< relref "formation_control" >}}) using dual quaternions, the formation error is controlled through a [sliding modes controller]({{< relref "sliding_modes" >}}) and one term is added for [collision avoidance]({{< relref "collision_avoidance" >}}) using [Artificial Potential Function]({{< relref "artificial_potential_function" >}}).

The part of artificial potential function is interesting and intuitive.


## Info {#info}


## Notes {#notes}


### Resumo {#resumo}

The work proposes a formation control using dual quaternions, the formation error is controlled through a sliding modes controller and one term is added for collision avoidance using Artificial Potential Function.

The part of artificial potential function is interesting and intuitive.
